#include <fcntl.h>
#include <io.h>
#include <stddef.h>
#include <stdio.h>
#include <stdlib.h>
#include <wchar.h>
#include <windows.h>

wchar_t bdHorz = L'━';
wchar_t bdVert = L'┃';
wchar_t bdCTL = L'┏';
wchar_t bdCTR = L'┓';
wchar_t bdCBL = L'┗';
wchar_t bdCBR = L'┛';
wchar_t bdTT = L'┳';
wchar_t bdTR = L'┫';
wchar_t bdTL = L'┣';
wchar_t bdTB = L'┻';
wchar_t bdPlus = L'╋';

typedef wchar_t Board[18][36] ;



/*
           10        20        30
 01234567890123456789012345678901234
0┏━━━┳━━━┳━━━┳━━━┳━━━┳━━━┳━━━┳━━━┓
1┃  ┃ 󰡘 ┃  ┃ 󰡚 ┃  ┃  ┃ 󰡘 ┃  ┃ 8
2┣━━━╋━━━╋━━━╋━━━╋━━━╋━━━╋━━━╋━━━┫
3┃  ┃  ┃  ┃  ┃  ┃  ┃  ┃  ┃ 7
4┣━━━╋━━━╋━━━╋━━━╋━━━╋━━━╋━━━╋━━━┫
5┃   ┃   ┃   ┃   ┃   ┃   ┃   ┃   ┃ 6
6┣━━━╋━━━╋━━━╋━━━╋━━━╋━━━╋━━━╋━━━┫
7┃   ┃   ┃   ┃   ┃   ┃   ┃   ┃   ┃ 5
8┣━━━╋━━━╋━━━╋━━━╋━━━╋━━━╋━━━╋━━━┫
9┃   ┃   ┃   ┃   ┃   ┃   ┃   ┃   ┃ 4
0┣━━━╋━━━╋━━━╋━━━╋━━━╋━━━╋━━━╋━━━┫
1┃   ┃   ┃   ┃   ┃   ┃   ┃   ┃   ┃ 3
2┣━━━╋━━━╋━━━╋━━━╋━━━╋━━━╋━━━╋━━━┫
3┃  ┃  ┃  ┃  ┃  ┃  ┃  ┃  ┃ 2
4┣━━━╋━━━╋━━━╋━━━╋━━━╋━━━╋━━━╋━━━┫
5┃  ┃ 󰡘 ┃  ┃ 󰡚 ┃  ┃  ┃ 󰡘 ┃  ┃ 1
6┗━━━┻━━━┻━━━┻━━━┻━━━┻━━━┻━━━┻━━━┛
7  A   B   C   D   E   F   G   H
*/

int main(void) {
  // This is some windows garbage to allow us to print unicode to the terminal
  // TODO: Make this dynamic to OS for compiling
  _setmode(_fileno(stdout), _O_U16TEXT);

  wprintf(L"Hello, from chess! %lc\n", L'\ue261');

  return EXIT_SUCCESS;
}
