/*
           10        20        30
 0123456789012345678901234567890123456
0    A   B   C   D   E   F   G   H
1  ┏━━━┳━━━┳━━━┳━━━┳━━━┳━━━┳━━━┳━━━┓
28 ┃  ┃ 󰡘 ┃  ┃ 󰡚 ┃  ┃  ┃ 󰡘 ┃  ┃ 8
3  ┣━━━╋━━━╋━━━╋━━━╋━━━╋━━━╋━━━╋━━━┫
47 ┃  ┃  ┃  ┃  ┃  ┃  ┃  ┃  ┃ 7
5  ┣━━━╋━━━╋━━━╋━━━╋━━━╋━━━╋━━━╋━━━┫
66 ┃   ┃   ┃   ┃   ┃   ┃   ┃   ┃   ┃ 6
7  ┣━━━╋━━━╋━━━╋━━━╋━━━╋━━━╋━━━╋━━━┫
85 ┃   ┃   ┃   ┃   ┃   ┃   ┃   ┃   ┃ 5
9  ┣━━━╋━━━╋━━━╋━━━╋━━━╋━━━╋━━━╋━━━┫
04 ┃   ┃   ┃   ┃   ┃   ┃   ┃   ┃   ┃ 4
1  ┣━━━╋━━━╋━━━╋━━━╋━━━╋━━━╋━━━╋━━━┫
23 ┃   ┃   ┃   ┃   ┃   ┃   ┃   ┃   ┃ 3
3  ┣━━━╋━━━╋━━━╋━━━╋━━━╋━━━╋━━━╋━━━┫
42 ┃  ┃  ┃  ┃  ┃  ┃  ┃  ┃  ┃ 2
5  ┣━━━╋━━━╋━━━╋━━━╋━━━╋━━━╋━━━╋━━━┫
61 ┃  ┃ 󰡘 ┃  ┃ 󰡚 ┃  ┃  ┃ 󰡘 ┃  ┃ 1
7  ┗━━━┻━━━┻━━━┻━━━┻━━━┻━━━┻━━━┻━━━┛
8    A   B   C   D   E   F   G   H
*/

#include "board.h"
#include <fcntl.h>
#include <io.h>
#include <stddef.h>
#include <stdio.h>
#include <stdlib.h>
#include <stdint.h>
// #include <wchar.h>
#include <windows.h>



int main(void) {
  // TODO: Make this dynamic to OS for compiling
  // This is some windows garbage to allow us to print unicode to the terminal
  _setmode(_fileno(stdout), _O_U16TEXT);

  // wprintf(L"Hello, from chess! %lc\n", L'\ue261');

  Board board;
  initBoard(board);

  drawBoard(board);
  return EXIT_SUCCESS;
}
